app/views/posts/edit.html.erb

    <%= form.label :tags %><br />
    <%= form.text_field :tag_names, id: "post_tag_names", value: @post.tags.map(&:name).join(', ') %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]