app/views/posts/show.html.erb

  <strong>Tags:</strong>
  <%= @post.tags.map(&:name).join(', ') %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]