app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["body", "komentarz 1\r\n"], ["user_id", 1], ["created_at", "2024-06-18 11:47:09.945665"], ["updated_at", "2024-06-18 11:47:09.945665"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save