app/controllers/posts_controller.rb

SELECT "posts"."id" FROM "posts" INNER JOIN "posts_tags" ON "posts_tags"."post_id" = "posts"."id" INNER JOIN "tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "tags"."name" = ?  [["name", "animal"]]
SELECT DISTINCT "posts".* FROM "posts" WHERE (title LIKE '%animal%' OR description LIKE '%animal%' OR id IN (?))
SELECT DISTINCT "posts".* FROM "posts" WHERE "posts"."public" = ? AND (title LIKE '%hair%' OR description LIKE '%hair%' OR id IN (2))  [["public", 1]]
---
  def index
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @posts = Post.where("title LIKE :search OR description LIKE :search OR id IN (?)", search: search_term, ids: Post.joins(:tags).where(tags: { name: params[:search] }).pluck(:id))
                   .distinct
    else
      @posts = if user_signed_in?
                 Post.all
               else
                 Post.where(public: true)

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "turtle"], ["created_at", "2024-06-18 11:30:09.817237"], ["updated_at", "2024-06-18 11:30:09.817237"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "turtle"], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "public", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "turtle "], ["description", "turtle in water"], ["public", 1], ["user_id", 1], ["created_at", "2024-06-18 11:30:09.868450"], ["updated_at", "2024-06-18 11:30:09.868450"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "horse"], ["created_at", "2024-06-18 14:55:51.551428"], ["updated_at", "2024-06-18 14:55:51.551428"]]
---
  def create
    @post = current_user.posts.build(post_params)
    tag_names = params[:post][:tag_names].split(',')
    tag_names.each do |tag_name|
      tag = Tag.find_or_create_by(name: tag_name.strip)
      @post.tags << tag
    end
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "turtle 123"], ["updated_at", "2024-06-18 11:42:47.378312"], ["id", 1]]
---
  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)